frontend/controllers/CartController.php

SELECT * FROM `product` WHERE `prod_id` IN ('2', '4')
---
    public function actionIndex() {

        session_start();
        $prod_ids = [];
        if(isset($_SESSION['cart-item'])) {
            $prod_ids = $_SESSION['cart-item'];
        }

        $products = Product::find()->where(['prod_id' => $prod_ids ])->all();