frontend/controllers/HomeController.php

SELECT * FROM `product` WHERE store_id = '1'
---
    public function actionIndex($id = 0)
    {

        //echo Yii::getAlias('@frontend'); exit;
        $product = Product::find();

        if($id != 0) {
            $product = $product->where('store_id = :store_id', [':store_id' => $id]);
        }

        return $this->render('index',[
            'product' => $product->all()
        ]);