frontend/controllers/SiteController.php

SELECT * FROM `category`
SELECT * FROM `blogs`
SELECT * FROM `store`
SELECT * FROM `testimonials`
---
    public function actionIndex()
    {
        $sliders    = slider::find()->all();
     	$cat        = Category::find()->all();
        $blogs      = BLOG::find()->all();
        $store      = Store::find()->all();
        $userModel  = new SignupForm();
        $storeModel = new Store();

        $about_us = CMS::find()->where("cms_name = 'ABOUT US'")->one();
        $contact_us = CMS::find()->where("cms_name = 'CONTACT US'")->one();
        $pp = CMS::find()->where("cms_name = 'PRIVACY POLICY'")->one();
        $tc = CMS::find()->where("cms_name = 'TERMS & CONDITIONS'")->one();

        $testimonials = TESTIMONIALS::find()->all();