common/config/bootstrap.php

SELECT `store_id`, `store_name` FROM `store`
---
Event::on(View::className(), View::EVENT_BEFORE_RENDER, function() {
    $query = new Query;

    $data= $query->select('store_id,store_name')->from('store')->all();